schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
// ALL STATE
displayHeader dispHeader("dispHeader", _fonts[1]);
displayFooter dispFooter("dispFooter", _fonts[1]);
// RADIO
button2state  btn_RA_Mute("btn_RA_Mute");
button1state  btn_RA_prevSta("btn_RA_prevSta"), btn_RA_nextSta("btn_RA_nextSta");
button1state  btn_RA_staList("btn_RA_staList"), btn_RA_player("btn_RA_player"), btn_RA_dlna("btn_RA_dlna"), btn_RA_clock("btn_RA_clock");
button1state  btn_RA_sleep("btn_RA_sleep"), btn_RA_bright("btn_RA_bright"), btn_RA_equal("btn_RA_equal"), btn_RA_bt("btn_RA_bt");
button1state  btn_RA_off("btn_RA_off");
pictureBox    pic_RA_logo("pic_RA_logo");
textbox       txt_RA_sTitle("txt_RA_sTitle"), txt_RA_staName("txt_RA_staName"), txt_RA_irNum("txt_RA_irNum");
vuMeter       VUmeter_RA("VUmeter_RA");
slider        sdr_RA_volume("sdr_RA_volume");
// STATIONSLIST
stationsList  lst_RADIO("lst_RADIO");
// PLAYER
button2state  btn_PL_Mute("btn_PL_Mute"), btn_PL_pause("btn_PL_pause");
button1state  btn_PL_ready("btn_PL_ready"), btn_PL_shuffle("btn_PL_shuffle");
button1state  btn_PL_playAll("btn_PL_playAll"), btn_PL_fileList("btn_PL_fileList"), btn_PL_radio("btn_PL_radio"), btn_PL_cancel("btn_PL_cancel");
button1state  btn_PL_prevFile("btn_PL_prevFile"), btn_PL_nextFile("btn_PL_nextFile"), btn_PL_off("btn_PL_off");
button1state  btn_PL_playNext("btn_PL_playNext"), btn_PL_playPrev("btn_PL_playPrev");
textbox       txt_PL_fName("txt_PL_fName");
slider        sdr_PL_volume("sdr_PL_volume");
pictureBox    pic_PL_logo("pic_PL_logo");
progressbar   pgb_PL_progress("pgb_PL_progress");
// AUDIOFILESLIST
fileList      lst_PLAYER("lst_PLAYER");
// DLNA
button2state  btn_DL_Mute("btn_DL_Mute"), btn_DL_pause("btn_DL_pause");
button1state  btn_DL_radio("btn_DL_radio"), btn_DL_fileList("btn_DL_fileList"), btn_DL_cancel("btn_DL_cancel");
textbox       txt_DL_fName("txt_DL_fName");
slider        sdr_DL_volume("sdr_DL_volume");
pictureBox    pic_DL_logo("pic_DL_logo");
progressbar   pgb_DL_progress("pgb_DL_progress");
// DLNAITEMSLIST
dlnaList      lst_DLNA("lst_DLNA", &dlna, &_dlnaHistory[0], 10);
// CLOCK
imgClock      clk_CL_green("clk_CL_green");
button2state  btn_CL_Mute("btn_CL_Mute");
button1state  btn_CL_alarm("btn_CL_alarm"), btn_CL_radio("btn_CL_radio"), btn_CL_off("btn_CL_off");
slider        sdr_CL_volume("sdr_CL_volume");
// ALARM
alarmClock    clk_AL_red("clk_CL_green");
button1state  btn_AL_left("btn_AL_left"), btn_AL_right("btn_AL_right"), btn_AL_up("btn_AL_up"), btn_AL_down("btn_AL_down");
button1state  btn_AL_ready("btn_AL_ready");
// BRIGHTNESS
button1state  btn_BR_ready("btn_BR_ready");
pictureBox    pic_BR_logo("pic_BR_logo");
slider        sdr_BR_value("sdr_BR_value");
textbox       txt_BR_value("txt_BR_value");
// SLEEP
button1state  btn_SL_up("btn_SL_up"), btn_SL_down("btn_SL_down"), btn_SL_ready("btn_SL_ready"), btn_SL_cancel("btn_SL_cancel");
// EQUALIZER
slider        sdr_EQ_lowPass("sdr_E_LP"), sdr_EQ_bandPass("sdr_E_BP"), sdr_EQ_highPass("sdr_E_HP"), sdr_EQ_balance("sdr_E_BAL");
textbox       txt_EQ_lowPass("txt_E_LP"), txt_EQ_bandPass("txt_E_BP"), txt_EQ_highPass("txt_E_HP"), txt_EQ_balance("txt_E_BAL");
button1state  btn_EQ_lowPass("btn_E_LP");
button1state  btn_EQ_bandPass("btn_E_BP"), btn_EQ_highPass("btn_E_HP"), btn_EQ_balance("btn_E_BAL");
button1state  btn_EQ_Radio("btn_EQ_Radio"), btn_EQ_Player("btn_EQ_Player");
button2state  btn_EQ_Mute("btn_EQ_Mute");
// BLUETOOTH
button2state  btn_BT_pause("btn_BT_pause"), btn_BT_power("btn_BT_power");
button1state  btn_BT_volDown("btn_BT_volDown"), btn_BT_volUp("btn_BT_volUp"), btn_BT_radio("btn_BT_radio"), btn_BT_mode("btn_BT_mode");
pictureBox    pic_BT_mode("pic_BT_mode");
textbox       txt_BT_mode("txt_BT_mode");
textbox       txt_BT_volume("txt_BT_volume");
// IR_SETTINGS
button1state  btn_IR_radio("btn_IR_radio");

/*  ╔═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
    ║                                                     D E F A U L T S E T T I N G S                                                         ║
    ╚═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format off
boolean defaultsettings(){

    if(!SD_MMC.exists("/ir_buttons.json")){  // if not found create one
        File file = SD_MMC.open("/ir_buttons.json", "w", true);
        file.write((uint8_t*)ir_buttons_json, sizeof(ir_buttons_json));
        file.close();
    }
    irb.loadButtonsFromJSON("/ir_buttons.json");
    for(uint i = 0; i < _settings.numOfIrButtons; i++) {
    //    log_w("%i, 0x%x", i, _settings.irbuttons[i].val);
        ir.set_irButtons(i, _settings.irbuttons[i].val);
    }
    ir.set_irAddress(_settings.irbuttons[32].val);

    if(!SD_MMC.exists("/settings.json")){  // if not found create one
        updateSettings();
    }

    File file2 = SD_MMC.open("/settings.json","r", false);
    char*  jO = x_ps_calloc(1024, 1);
    char* tmp = x_ps_malloc(512);
    file2.readBytes(jO, 1024);
    _settingsHash = simpleHash(jO);
    file2.close();

    auto parseJson = [&](const char* s) { // lambda, inner function
        int16_t pos1 = 0, pos2 = 0, pos3 = 0;
        pos1 = indexOf(jO, s, 0);
        if(pos1 < 0) {log_e("index %s not found", s); return "0";}
        pos2 = indexOf(jO, ":", pos1) + 1;
        pos3 = indexOf(jO, ",\"", pos2);
        if(pos3 < 0) pos3 = indexOf(jO, "}", pos2);
        if(jO[pos2] == '\"'){pos2++; pos3--;}  // remove \" embraced strings
        strncpy(tmp, jO + pos2, pos3 - pos2);
        tmp[pos3 - pos2] = '\0';
        return (const char*)tmp;
    };

    auto computeMinuteOfTheDay = [&](const char* s){
        if(!s) return 0;
        int h = atoi(s);
        int m = atoi(s + 3);
        return h * 60 + m;
    };

    _cur_volume             = atoi(   parseJson("\"volume\":"));
    _volumeSteps            = atoi(   parseJson("\"volumeSteps\":"));
    _ringVolume             = atoi(   parseJson("\"ringVolume\":"));
    _volumeAfterAlarm       = atoi(   parseJson("\"volumeAfterAlarm\":"));
    _BTvolume               = atoi(   parseJson("\"BTvolume\":"));
    _f_BTpower              = (strcmp(parseJson("\"BTpower\":"), "true") == 0) ? 1 : 0;
    _alarmtime[0]           = computeMinuteOfTheDay(parseJson("\"alarmtime_sun\":"));
    _alarmtime[1]           = computeMinuteOfTheDay(parseJson("\"alarmtime_mon\":"));
    _alarmtime[2]           = computeMinuteOfTheDay(parseJson("\"alarmtime_tue\":"));
    _alarmtime[3]           = computeMinuteOfTheDay(parseJson("\"alarmtime_wed\":"));
    _alarmtime[4]           = computeMinuteOfTheDay(parseJson("\"alarmtime_thu\":"));
    _alarmtime[5]           = computeMinuteOfTheDay(parseJson("\"alarmtime_fri\":"));
    _alarmtime[6]           = computeMinuteOfTheDay(parseJson("\"alarmtime_sat\":"));
    _alarmdays              = atoi(   parseJson("\"alarm_weekdays\":"));
    _f_timeAnnouncement     = (strcmp(parseJson("\"timeAnnouncing\":"), "true") == 0) ? 1 : 0;
    _f_mute                 = (strcmp(parseJson("\"mute\":"), "true") == 0) ? 1 : 0;
    _brightness             = atoi(   parseJson("\"brightness\":"));
    _sleeptime              = atoi(   parseJson("\"sleeptime\":"));
    _cur_station            = atoi(   parseJson("\"station\":"));
    _toneLP                 = atoi(   parseJson("\"toneLP\":"));
    _toneBP                 = atoi(   parseJson("\"toneBP\":"));
    _toneHP                 = atoi(   parseJson("\"toneHP\":"));
    _toneBAL                = atoi(   parseJson("\"balance\":"));
    _timeFormat             = atoi(   parseJson("\"timeFormat\":"));
    _TZName                 =         parseJson("\"Timezone_Name\":");
    _TZString               =         parseJson("\"Timezone_String\":");
    _lastconnectedhost      =         parseJson("\"lastconnectedhost\":");
    _sleepMode              = atoi(   parseJson("\"sleepMode\":"));
    _cur_AudioFileNr        = atoi(   parseJson("\"cur_AudioFileNr\":")); // this is the position of the file within the (alpha ordered) folder starting with 0
    strcpy(_cur_AudioFolder,          parseJson("\"cur_AudioFolder\":"));
    _state                  = atoi(   parseJson("\"state\":"));

    // guards------------------------------------------------------------------------------------------------------
    if(!SD_MMC.exists(_cur_AudioFolder)) strcpy(_cur_AudioFolder, "/audiofiles"); // set default if not found
    if(_cur_AudioFileNr > 65000) _cur_AudioFileNr = 0; // unlikely (65495 is -1)
    // ------------------------------------------------------------------------------------------------------------

    if(jO) {free(jO);   jO = NULL;}
    if(tmp){free(tmp); tmp = NULL;}


    if(!SD_MMC.exists("/stations.json")){  // if not found create one
        File file1 = SD_MMC.open("/stations.json","w", true);
        file1.write((uint8_t*)stations_json, sizeof(stations_json) -1); // without termination
        file1.close();
    }
    staMgnt.updateStationsList();
    return true;
}
// clang-format on

// clang-format off
void updateSettings(){
    if(!_lastconnectedhost)_lastconnectedhost = "";
    char*  jO = x_ps_malloc(1024 + _lastconnectedhost.length()); // JSON Object
    char tmp[40 + _lastconnectedhost.length()];
    strcpy(jO,   "{");
    sprintf(tmp, "\"volume\":%i", _cur_volume);                                             strcat(jO, tmp);
    sprintf(tmp, ",\"volumeSteps\":%i", _volumeSteps);                                      strcat(jO, tmp);
    sprintf(tmp, ",\"ringVolume\":%i", _ringVolume);                                        strcat(jO, tmp);
    sprintf(tmp, ",\"volumeAfterAlarm\":%i", _volumeAfterAlarm);                            strcat(jO, tmp);
    sprintf(tmp, ",\"BTvolume\":%i", _BTvolume);                                            strcat(jO, tmp);
    strcat(jO,   ",\"BTpower\":"); (_f_BTpower == true) ?                                   strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\"alarmtime_sun\":%02d:%02d", _alarmtime[0] / 60, _alarmtime[0] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\"alarmtime_mon\":%02d:%02d", _alarmtime[1] / 60, _alarmtime[1] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\"alarmtime_tue\":%02d:%02d", _alarmtime[2] / 60, _alarmtime[2] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\"alarmtime_wed\":%02d:%02d", _alarmtime[3] / 60, _alarmtime[3] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\"alarmtime_thu\":%02d:%02d", _alarmtime[4] / 60, _alarmtime[4] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\"alarmtime_fri\":%02d:%02d", _alarmtime[5] / 60, _alarmtime[5] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\"alarmtime_sat\":%02d:%02d", _alarmtime[6] / 60, _alarmtime[6] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\"alarm_weekdays\":%i", _alarmdays);                                     strcat(jO, tmp);
    strcat(jO,   ",\"timeAnnouncing\":"); (_f_timeAnnouncement == true) ?                   strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    strcat(jO,   ",\"mute\":");           (_f_mute == true)             ?                   strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\"brightness\":%i", _brightness);                                        strcat(jO, tmp);
    sprintf(tmp, ",\"sleeptime\":%i", _sleeptime);                                          strcat(jO, tmp);
    sprintf(tmp, ",\"lastconnectedhost\":\"%s\"", _lastconnectedhost.c_str());              strcat(jO, tmp);
    sprintf(tmp, ",\"station\":%i", _cur_station);                                          strcat(jO, tmp);
    sprintf(tmp, ",\"Timezone_Name\":\"%s\"", _TZName.c_str());                             strcat(jO, tmp);
    sprintf(tmp, ",\"Timezone_String\":\"%s\"", _TZString.c_str());                         strcat(jO, tmp);
    sprintf(tmp, ",\"toneLP\":%i", _toneLP);                                                strcat(jO, tmp);
    sprintf(tmp, ",\"toneBP\":%i", _toneBP);                                                strcat(jO, tmp);
    sprintf(tmp, ",\"toneHP\":%i", _toneHP);                                                strcat(jO, tmp);
    sprintf(tmp, ",\"balance\":%i", _toneBAL);                                              strcat(jO, tmp);
    sprintf(tmp, ",\"timeFormat\":%i", _timeFormat);                                        strcat(jO, tmp);
    sprintf(tmp, ",\"cur_AudioFileNr\":%i", _cur_AudioFileNr);                              strcat(jO, tmp);
    sprintf(tmp, ",\"cur_AudioFolder\":\"%s\"", _cur_AudioFolder);                          strcat(jO, tmp);
    sprintf(tmp, ",\"state\":%i", _state);                                                  strcat(jO, tmp);
    sprintf(tmp, ",\"sleepMode\":%i}", _sleepMode);                                         strcat(jO, tmp);

    if(_settingsHash != simpleHash(jO)) {
        File file = SD_MMC.open("/settings.json", "w", false);
        if(!file) {
            log_e("file \"settings.json\" not found");
            return;
        }
        file.print(jO);
        _settingsHash = simpleHash(jO);
    }
    if(jO){free(jO); jO = NULL;}
}
// clang-format on

