schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
const char* scaleImage(const char* path) {
    if((!endsWith(path, "bmp")) && (!endsWith(path, "jpg")) && (!endsWith(path, "gif"))) { // not a image
        return path;
    }
    static char pathBuff[256];
    memset(pathBuff, 0, sizeof(pathBuff));
    char* pch = strstr(path + 1, "/");
    if(pch) {
        strncpy(pathBuff, path, (pch - path));
        strcat(pathBuff, _prefix);
        strcat(pathBuff, pch);
    }
    else {
        return path; // invalid path
    }
    return pathBuff;
}

void setVolume(uint8_t vol) {
    static int16_t oldVol = -1;
    log_i("vol %i   oldVol %i", vol, oldVol);
    if(vol == oldVol) return;
    _cur_volume = vol;
    oldVol = vol;
    dispHeader.updateVolume(_cur_volume);
    sdr_CL_volume.setValue(_cur_volume);
    sdr_DL_volume.setValue(_cur_volume);
    sdr_PL_volume.setValue(_cur_volume);
    sdr_RA_volume.setValue(_cur_volume);
    SerialPrintfln("action: ...  current volume is " ANSI_ESC_CYAN "%d", _cur_volume);

#if DECODER > 1 // ES8388, AC101 ...
    uint8_t v = map_l(_cur_volume, 0, _volumeSteps, 0, 63);
    if(HP_DETECT == -1) {
        if(_f_mute){
            dac.SetVolumeSpeaker(0);
            dac.SetVolumeHeadphone(0);
        }
        else{
            dac.SetVolumeSpeaker(v);
            dac.SetVolumeHeadphone(v);
        }
    }
    else {
        if(_f_mute){
            dac.SetVolumeSpeaker(0);
            dac.SetVolumeHeadphone(0);
        }
        else{
            if(digitalRead(HP_DETECT) == HIGH) {
                // SerialPrintfln("HP_Detect = High, volume %i", vol);
                dac.SetVolumeSpeaker(v);
                dac.SetVolumeHeadphone(0);
            }
            else {
                // SerialPrintfln("HP_Detect = Low, volume %i", vol);
                dac.SetVolumeSpeaker(0);
                dac.SetVolumeHeadphone(v);
            }
        }
    }
#endif
}

uint8_t downvolume() {
    uint8_t steps = _volumeSteps / 20;
    if(_cur_volume == 0) return _cur_volume;
    else if (steps < _cur_volume) _cur_volume -= steps;
    else _cur_volume --;
    sdr_CL_volume.setValue(_cur_volume);
    sdr_DL_volume.setValue(_cur_volume);
    sdr_PL_volume.setValue(_cur_volume);
    sdr_RA_volume.setValue(_cur_volume);
    _f_mute = false;
    muteChanged(_f_mute); // set mute off
    return _cur_volume;
}

uint8_t upvolume() {
    uint8_t steps = _volumeSteps / 20;
    if(_cur_volume == _volumeSteps) return _cur_volume;
    else if (_volumeSteps > _cur_volume + steps) _cur_volume += steps;
    else  _cur_volume ++;
    sdr_CL_volume.setValue(_cur_volume);
    sdr_DL_volume.setValue(_cur_volume);
    sdr_PL_volume.setValue(_cur_volume);
    sdr_RA_volume.setValue(_cur_volume);
    _f_mute = false;
    muteChanged(_f_mute); // set mute off
    return _cur_volume;
}

void setStation(uint16_t sta) {
    static uint16_t old_cur_station = 0;
    // SerialPrintfln("sta %d, _cur_station %d", sta, _cur_station );
    if(sta == 0) return;
    if(sta > staMgnt.getSumStations()) sta = _cur_station;
    free(_stationURL);
    _stationURL = x_ps_strdup(staMgnt.getStationUrl(sta));
    _homepage = "";
    SerialPrintfln("action: ...  switch to station " ANSI_ESC_CYAN "%d", sta);

    if(_f_isWebConnected && sta == old_cur_station && _state == RADIO) { // Station is already selected
        _f_newStreamTitle = true;
    }
    else {
        _streamTitle[0] = '\0';
        _icyDescription[0] = '\0';
        _f_newStreamTitle = true;
        _f_newIcyDescription = true;
        connecttohost(_stationURL);
    }
    old_cur_station = sta;
    StationsItems();
    if(_state == RADIO) showLogoAndStationName(true);
    dispFooter.updateStation(_cur_station);
}
void nextStation() {
    setStation(staMgnt.nextStation());
}
void nextFavStation() {
    setStation(staMgnt.nextFavStation());
}
void prevStation() {
    setStation(staMgnt.prevStation());
}
void prevFavStation() {
    setStation(staMgnt.prevFavStation());
}
void setStationByNumber(uint16_t staNr){
    setStation(staMgnt.setStationByNumber(staNr));
}

void StationsItems() {
    if(!_stationName_air)  _stationName_air = (char*)calloc(1, 1);
    char* stationLogo_air = x_ps_malloc(strlen(_stationName_air) + 15);
    strcpy(stationLogo_air, "/logo/");
    strcat(stationLogo_air, _stationName_air);
    strcat(stationLogo_air, ".jpg");
    char staNr[10]; itoa(_cur_station, staNr, 10);

    if(_cur_station == 0){
        webSrv.send("stationLogo=", stationLogo_air);
        webSrv.send("stationNr=", staNr);
        webSrv.send("", "stationURL=" + _lastconnectedhost);
    }
    else{
        webSrv.send("stationLogo=", "/logo/" + String(staMgnt.getStationName(_cur_station)) + ".jpg");
        webSrv.send("stationNr=", staNr);
        if(_stationURL) webSrv.send("stationURL=", String(_stationURL));
    }
    if(stationLogo_air){free(stationLogo_air); stationLogo_air = NULL;}
}

void setStationViaURL(const char* url) {
    if(_stationName_air) {free(_stationName_air); _stationName_air = NULL;}
    _cur_station = 0;
    free(_stationURL);
    _stationURL = x_ps_strdup(url);
    connecttohost(url);
    StationsItems();
    if(_state == RADIO) {
        clearStreamTitle();
        showLogoAndStationName(true);
    }
    dispFooter.updateStation(0); // set 000
}

void savefile(const char* fileName, uint32_t contentLength) { // save the uploadfile on SD_MMC
    char fn[256];

    if(!_f_SD_Upload && endsWith(fileName, "jpg")) {
        strcpy(fn, "/logo");
        strcat(fn, _prefix);
        if(!startsWith(fileName, "/")) strcat(fn, "/");
        strcat(fn, fileName);
        if(webSrv.uploadB64image(SD_MMC, fn, contentLength)) {
            SerialPrintfln("save image " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
            webSrv.sendStatus(200);
        }
        else webSrv.sendStatus(400);
    }
    else {
        _f_SD_Upload = false;
        if(!startsWith(fileName, "/")) {
            strcpy(fn, "/");
            strcat(fn, fileName);
        }
        else { strcpy(fn, fileName); }
        if(webSrv.uploadfile(SD_MMC, fn, contentLength)) {
            SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
            webSrv.sendStatus(200);
        }
        else {
            SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD failed", fn);
            webSrv.sendStatus(400);
        }
    }
}

String setI2STone() {
    int8_t LP = _toneLP;
    int8_t BP = _toneBP;
    int8_t HP = _toneHP;
    int8_t BAL = _toneBAL;
    audioSetTone(LP, BP, HP, BAL);
    sprintf(_chbuf, "LowPass=%i\nBandPass=%i\nHighPass=%i\nBalance=%i\n", LP, BP, HP, BAL);
    String tone = String(_chbuf);
    return tone;
}

void SD_playFile(const char* path, const char* fileName) {
    sprintf(_chbuf, "%s/%s", path, fileName);
    int32_t idx = indexOf(_chbuf, "\033[", 1);
    if(idx == -1) { ; }          // do nothing
    else { _chbuf[idx] = '\0'; } // remove color and filesize
    SD_playFile(_chbuf, 0, true);
}

void SD_playFile(const char* path, uint32_t resumeFilePos, bool showFN) {
    if(!path) return;                            // avoid a possible crash
    if(endsWith(path, "ogg")) resumeFilePos = 0; // resume only mp3, m4a, flac and wav
    if(endsWith(path, "m3u")) {
        if(SD_MMC.exists(path)) {
            preparePlaylistFromFile(path);
            processPlaylist(true);
        }
        return;
    }
    _playerSubmenue = 1;
    changeState(PLAYER);
    int32_t idx = lastIndexOf(path, '/');
    if(idx < 0) return;
    strncpy(_cur_AudioFolder, path, idx);
    _cur_AudioFolder[idx] = '\0';

