schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
// clang-format on
void changeState(int32_t state){
//    log_i("new state %i, current state %i radioSubMenue %i", state, _state, _radioSubmenue);
    switch(_state){
        case RADIO:         sdr_RA_volume.disable();
                            btn_RA_Mute.disable();      btn_RA_prevSta.disable();  btn_RA_nextSta.disable();
                            btn_RA_staList.disable();   btn_RA_player.disable();   btn_RA_dlna.disable();     btn_RA_clock.disable();   btn_RA_sleep.disable();
                            btn_RA_bright.disable();    btn_RA_equal.disable();    pic_RA_logo.disable();     btn_RA_bt.disable();      btn_RA_off.disable();
                            txt_RA_sTitle.disable();    txt_RA_staName.disable();  txt_RA_irNum.disable();    VUmeter_RA.disable(); break;
        case STATIONSLIST:  lst_RADIO.disable();
                            break;
        case PLAYER:        btn_PL_Mute.disable();      btn_PL_pause.disable();    btn_PL_cancel.disable();    btn_PL_off.disable();
                            btn_PL_prevFile.disable();  btn_PL_nextFile.disable(); btn_PL_ready.disable();    btn_PL_playAll.disable(); btn_PL_shuffle.disable();
                            btn_PL_fileList.hide();     btn_PL_radio.hide();       txt_PL_fName.disable();    pgb_PL_progress.disable();
                            sdr_PL_volume.hide();       pic_PL_logo.disable();
                            break;
        case AUDIOFILESLIST: lst_PLAYER.disable();
                            break;
        case DLNA:          btn_DL_Mute.disable();      btn_DL_pause.disable();    btn_DL_cancel.disable();
                            btn_DL_fileList.disable();  btn_DL_radio.disable();    txt_DL_fName.disable();
                            sdr_DL_volume.hide();       pic_DL_logo.disable();     pgb_DL_progress.disable();
                            break;
        case DLNAITEMSLIST: lst_DLNA.disable();
                            break;
        case CLOCK:         btn_CL_Mute.disable();      btn_CL_alarm.disable();    btn_CL_radio.disable();
                            /* clk_CL_green.disable(); */ sdr_CL_volume.hide();    btn_CL_off.disable();
                            break;
        case ALARM:         clk_AL_red.disable();       btn_AL_left.disable();     btn_AL_right.disable();    btn_AL_up.disable();      btn_AL_down.disable();
                            btn_AL_ready.disable();
                            break;
        case SLEEP:         btn_SL_up.disable();        btn_SL_down.disable();     btn_SL_ready.disable();    btn_SL_cancel.disable();
                            break;
        case BRIGHTNESS:    sdr_BR_value.disable();     btn_BR_ready.disable();    pic_BR_logo.disable();     txt_BR_value.disable();
                            break;
        case EQUALIZER:     sdr_EQ_lowPass.disable();   sdr_EQ_bandPass.disable(); sdr_EQ_highPass.disable(); sdr_EQ_balance.disable();
                            btn_EQ_lowPass.disable();   btn_EQ_bandPass.disable(); btn_EQ_highPass.disable(); btn_EQ_balance.disable(); btn_EQ_Radio.disable();
                            txt_EQ_lowPass.disable();   txt_EQ_bandPass.disable(); txt_EQ_highPass.disable(); txt_EQ_balance.disable(); btn_EQ_Player.disable();
                            btn_EQ_Mute.disable();
                            break;
        case BLUETOOTH:     btn_BT_volDown.disable();   btn_BT_volUp.disable();    btn_BT_pause.disable();    btn_BT_radio.disable();   btn_BT_mode.disable();
                            btn_BT_power.disable();     pic_BT_mode.disable();     txt_BT_volume.disable();   txt_BT_mode.disable();
                            break;
        case IR_SETTINGS:   btn_IR_radio.disable();
                            break;
    }
    _f_volBarVisible = false;
    if(_timeCounter.timer){setTimeCounter(0);}
    if(state != CLOCK) clk_CL_green.disable();
    dispHeader.updateItem(_hl_item[state]);
    switch(state) {
        case RADIO:{
            txt_RA_staName.enable();
            pic_RA_logo.enable();
            if(_state != RADIO) clearWithOutHeaderFooter();
            if(_radioSubmenue == 0){
                if(_f_irResultSeen){txt_RA_irNum.hide(); setStationByNumber(_irResult); _f_irResultSeen = false;} // ir_number, valid between 1 ... 999
                if(_state != RADIO) {showLogoAndStationName(true);}
                setTimeCounter(0);
                VUmeter_RA.show();
                txt_RA_sTitle.setText("");
                txt_RA_sTitle.show();
                _f_newStreamTitle = true;
            }
            if(_radioSubmenue == 1){ // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                clearTitle();
                sdr_RA_volume.show();
                btn_RA_Mute.show();
                btn_RA_prevSta.show();   btn_RA_nextSta.show();          btn_RA_staList.show();
            //    txt_RA_staName.show();
                setTimeCounter(2);
            }
            if(_radioSubmenue == 2){ // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                sdr_RA_volume.hide();
                btn_RA_player.show();    btn_RA_dlna.show();             btn_RA_clock.show();
                btn_RA_sleep.show();     btn_RA_bright.show(!_f_brightnessIsChangeable); btn_RA_equal.show();
                btn_RA_bt.show(!_f_BtEmitterFound); btn_RA_off.show();
                setTimeCounter(2);
            }
            if(_radioSubmenue == 3){ // show Numbers from IR
                char buf[10];
                itoa(_irNumber, buf, 10);
                txt_RA_irNum.setText(buf, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
                txt_RA_irNum.show();
                setTimeCounter(1);
            }
            if(_state != RADIO) webSrv.send("changeState=", "RADIO");
            break;
        }

        case STATIONSLIST:{
            clearWithOutHeaderFooter();
            lst_RADIO.show();
            setTimeCounter(4);
            break;
        }

        case PLAYER: {
            if(_state != PLAYER) clearWithOutHeaderFooter();
            pic_PL_logo.enable();
            if(_playerSubmenue == 0){
                _SD_content.listDir(_cur_AudioFolder, true, false);
                _cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr));
                pgb_PL_progress.hide();
                if(_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                showAudioFileNumber();
                txt_PL_fName.show();
                btn_PL_prevFile.show(); btn_PL_nextFile.show(); btn_PL_ready.show(); btn_PL_playAll.show(); btn_PL_shuffle.show(); btn_PL_fileList.show(); btn_PL_radio.show(); btn_PL_off.show();
            }
            if(_playerSubmenue == 1){
                pgb_PL_progress.setValue(0);
                pgb_PL_progress.show();
                sdr_PL_volume.show();
            //    txt_PL_fName.setText("");
                btn_PL_Mute.show(); btn_PL_pause.setOff(); btn_PL_pause.show(); btn_PL_cancel.show(); btn_PL_playNext.show();  btn_PL_playPrev.show(); txt_PL_fName.show();
            }
            break;
        }
        case AUDIOFILESLIST: {
            clearWithOutHeaderFooter();
            lst_PLAYER.show(_cur_AudioFolder, _cur_AudioFileNr);
            setTimeCounter(4);
            break;
        }
        case DLNA:{
            clearWithOutHeaderFooter();
            pic_DL_logo.enable();
            pgb_DL_progress.setValue(0);
            pgb_DL_progress.show();
            showFileLogo(DLNA);
            btn_DL_Mute.show();    btn_DL_pause.show();   btn_DL_cancel.show(); btn_DL_fileList.show(); btn_DL_radio.show();
            txt_DL_fName.show();
            sdr_DL_volume.show();
            break;
        }
        case DLNAITEMSLIST:{
            lst_DLNA.show(_currDLNAsrvNr, dlna.getServer(), dlna.getBrowseResult(), &_dlnaLevel, _dlnaMaxItems);
            setTimeCounter(4);
            break;
        }
        case CLOCK:{
            if(_clockSubMenue == 0){
                setTimeCounter(0);
                btn_CL_Mute.hide(); btn_CL_alarm.hide(); btn_CL_radio.hide(); sdr_CL_volume.hide(); btn_CL_off.hide();
            }
            if(_clockSubMenue == 1){
                btn_CL_Mute.show();     btn_CL_alarm.show();    btn_CL_radio.show(); sdr_CL_volume.show(); btn_CL_off.show();
                setTimeCounter(2);
            }
            if(clk_CL_green.isDisabled()) {clearWithOutHeaderFooter();  clk_CL_green.show();}
            break;
        }
        case ALARM:{
            clearWithOutHeaderFooter();
            clk_AL_red.show();          btn_AL_left.show();     btn_AL_right.show();    btn_AL_up.show();      btn_AL_down.show();
            btn_AL_ready.show();
            break;
        }
        case SLEEP:{
            clearWithOutHeaderFooter();
            display_sleeptime();
            btn_SL_up.show();           btn_SL_down.show();       btn_SL_ready.show();    btn_SL_cancel.show();
            if(TFT_CONTROLLER < 2) drawImage("/common/Night_Gown.bmp", 198, 23);
            else                   drawImage("/common/Night_Gown.bmp", 280, 45);
            break;
        }
        case BRIGHTNESS:{
            clearWithOutHeaderFooter();
            btn_BR_ready.show(); pic_BR_logo.show();
            sdr_BR_value.show();
            txt_BR_value.setText(int2str(_brightness), TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
            txt_BR_value.show();
            break;
        }
        case EQUALIZER:
            if(_state != EQUALIZER) clearWithOutHeaderFooter();
            sdr_EQ_lowPass.show(); sdr_EQ_bandPass.show(); sdr_EQ_highPass.show(); sdr_EQ_balance.show();
            btn_EQ_lowPass.show(); btn_EQ_bandPass.show(); btn_EQ_highPass.show(); btn_EQ_balance.show(); btn_EQ_Radio.show(); btn_EQ_Player.show(); btn_EQ_Mute.show();
            txt_EQ_lowPass.show(); txt_EQ_bandPass.show(); txt_EQ_highPass.show(); txt_EQ_balance.show();
            break;

        case BLUETOOTH: {
            clearWithOutHeaderFooter();
            btn_BT_volUp.show(); btn_BT_volDown.show(); btn_BT_pause.show(); btn_BT_mode.show(); btn_BT_radio.show(); btn_BT_power.show(); pic_BT_mode.show();
            char* mode = strdup(bt_emitter.getMode());
            if(strcmp(mode, "RX") == 0){
                txt_BT_mode.writeText("RECEIVER", TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
                if(bt_emitter.isConnected()) muteChanged(true);
            }
            else {
                txt_BT_mode.writeText("EMITTER", TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
            }
            txt_BT_mode.setBGcolor(TFT_BROWN); txt_BT_mode.show();
            char c[10]; sprintf(c, "Vol: %02i", bt_emitter.getVolume()); txt_BT_volume.writeText(c, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER); txt_BT_volume.show();
            if(_state != BLUETOOTH) webSrv.send("changeState=", "BLUETOOTH");
            if(mode){ free(mode); mode = NULL;}
            break;
        }
        case IR_SETTINGS:
            clearWithOutHeaderFooter();
            btn_IR_radio.show();
            break;
    }
    _state = state;
}
// clang-format on

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                    L O O P                                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

void loop() {
    if(!_f_ESPfound) return;    // Guard:  wrong chip?
    if(!_f_SD_MMCfound) return; // Guard:  SD_MMC could not be initialisized
    vTaskDelay(1); // feed the watchdog
    webSrv.loop();
    ir.loop();
    tp.loop();
    ftpSrv.handleFTP();
    ArduinoOTA.handle();
    dlna.loop();
    bt_emitter.loop();

    if(_f_dlnaBrowseServer) {_f_dlnaBrowseServer = false; dlna.browseServer(_currDLNAsrvNr, _dlnaHistory[_dlnaLevel].objId, _totalNumberReturned);}
    if(_f_clearLogo)        {_f_clearLogo = false; clearLogo();}
    if(_f_clearStationName) { _f_clearStationName = false; clearStationName();}

    if(_f_playlistEnabled) {
        if(!_f_playlistNextFile) {
            if(!audioIsRunning() && !_f_pauseResume) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next playlist file");
                processPlaylist(false);
                _playlistTime = millis();
                _f_playlistNextFile = true;
            }
        }
        else {
            if(_playlistTime + 5000 < millis()) _f_playlistNextFile = false;
        }
    }
    //-----------------------------------------------------0.1 SEC------------------------------------------------------------------------------------
    if(_f_100ms) { // calls every 0.1 second
        _f_100ms = false;

        if(_state == RADIO && _radioSubmenue == 0) VUmeter_RA.update(audioGetVUlevel());

        static uint8_t factor = 0;
        static bool f_tc = false;
        if(factor > 0){
            factor --;
        }
        else{
            if(_timeCounter.timer > 0){
                factor = _timeCounter.factor;
                dispFooter.updateTC(_timeCounter.timer);
                _timeCounter.timer --;
                f_tc = true;
            }
            else{
                if(f_tc){
                    f_tc = false;
                    dispFooter.updateTC(0);
                    if(_f_sleeping) return; // tc is active by pressing a button, but do nothing if "off"
                    if(_state == RADIO) {
                        _radioSubmenue = 0;
                        changeState(RADIO);
                    }
                    else if(_state == CLOCK) {
                        _clockSubMenue = 0;
                        changeState(CLOCK);
                    }
                    //    else if(_state == RADIO && _f_switchToClock) { changeState(CLOCK); _f_switchToClock = false; }
                    else if(_state == STATIONSLIST) { changeState(RADIO); }
                    else if(_state == AUDIOFILESLIST) { _playerSubmenue = 0; changeState(PLAYER); }
                    else if(_state == DLNAITEMSLIST) { changeState(DLNA); }
                    else { ; } // all other, do nothing
                }
            }
        }

