schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
        if(!_f_rtc) {
            _f_rtc = rtc.hasValidTime();
        }

        // uint8_t vol = audioGetVolume();
        // uint8_t steps = _volumeSteps / 20;
        // if(_f_mute){
        //     if(vol){
        //         if(vol >= steps)  vol -= steps;
        //         else vol--;
        //         audioSetVolume(vol);
        //     }
        // }
        // else{
        //     if(vol != _cur_volume){
        //         if      (vol > _cur_volume + steps) vol -= steps;
        //         else if (vol > _cur_volume) vol --;
        //         else if (vol < _cur_volume - steps) vol += steps;
        //         else if (vol < _cur_volume) vol ++;
        //         audioSetVolume(vol);
        //     }
        // }
        if(audioGetVolume() && _f_mute) audioSetVolume(0, _volumeCurve);
        if(!_f_mute && (audioGetVolume() != _cur_volume)) audioSetVolume(_cur_volume, _volumeCurve);
    }
    //-----------------------------------------------------1 SEC--------------------------------------------------------------------------------------

    if(_f_1sec) { // calls every second
        _f_1sec = false;
        clk_CL_green.updateTime(rtc.getMinuteOfTheDay(), rtc.getweekday());

        //------------------------------------------ALARM MANAGEMENT----------------------------------------------------------------------------------
        if(_f_alarm) {
            _f_alarm = false;
            clearAll();
            dispHeader.updateItem("ALARM");
            dispHeader.updateTime(_time_s);
            dispFooter.show();
            if(_ringVolume > 0){ // alarm with bell
                showFileName("ALARM");
                drawImage("/common/Alarm.jpg", _winLogo.x, _winLogo.y);
                setTFTbrightness(_brightness);
                SerialPrintfln(ANSI_ESC_MAGENTA "Alarm");
                if(AMP_ENABLED != -1) {digitalWrite(AMP_ENABLED, HIGH);}
                setVolume(_ringVolume);
                audioSetVolume(_ringVolume, _volumeCurve);
                muteChanged(false);
                connecttoFS("/ring/alarm_clock.mp3");
            }
            else{ // alarm without bell
                _f_eof_alarm = true;
                return;
            }
        }
        if(_f_eof_alarm) { // AFTER RINGING
            _f_eof_alarm = false;
            if(!_f_rtc) return;
            _cur_volume = _volumeAfterAlarm;
            setVolume(_cur_volume);
            audioSetVolume(_cur_volume, _volumeCurve);
            dispHeader.updateVolume(_cur_volume);
            wake_up();
        }

        if(_f_stationsChanged) {
            _f_stationsChanged = false;
            staMgnt.updateStationsList();
        }

        //------------------------------------------UPDATE DISPLAY------------------------------------------------------------------------------------
        if(!_f_sleeping) {
            dispHeader.updateTime(_time_s, false);
            dispFooter.updateRSSI(WiFi.RSSI());

            if(_f_newBitRate) {
               _f_newBitRate = false;
               dispFooter.updateBitRate(_icyBitRate);
            }
            if(_f_newStationName) {
                _f_newStationName = false;
                showLogoAndStationName(false);
            }
        }
        //---------------------------------------------TIME SPEECH -----------------------------------------------------------------------------------
        static bool f_resume = false;
        if(_f_timeSpeech){ // speech the time 7 sec before a new hour is arrived
            _f_timeSpeech =  false;
            int hour = atoi(_time_s); hour++; if(hour == 24) hour = 0; //  extract the hour
            if(_f_mute) return;
            if(_f_sleeping) return;
            if(_state != RADIO) return;
            if(_f_timeAnnouncement) {
                f_resume = true;
                _f_eof = false;
                if(_timeFormat == 12) {if(hour > 12) hour -= 12;}
                sprintf(_chbuf, "/voice_time/%d_00.mp3", hour);
                SerialPrintfln("Time: ...... play Audiofile %s", _chbuf) connecttoFS(_chbuf);
                return;
            }
            else { SerialPrintfln("Time: ...... Announcement at %d o'clock is silent", hour); }
        }
        if(f_resume && _f_eof){
            f_resume = false;
            _f_eof = false;
            connecttohost(_lastconnectedhost.c_str());
            return;
        }
        //------------------------------------------HEADPHONE / LOUDSPEAKER --------------------------------------------------------------------------
        if(_f_hpChanged) {
            setVolume(_cur_volume);
            if(!digitalRead(HP_DETECT)) { SerialPrintfln("Headphone plugged in"); }
            else { SerialPrintfln("Headphone unplugged"); }
            _f_hpChanged = false;
        }
        //------------------------------------------AUDIO_CURRENT_TIME - DURATION---------------------------------------------------------------------
        if(audioIsRunning()){
            _audioFileDuration = audioGetFileDuration();
            if(_audioFileDuration > 0){
                _audioCurrentTime = audioGetCurrentTime();
                if(_state == PLAYER && _audioFileDuration){pgb_PL_progress.setNewMinMaxVal(0, _audioFileDuration); pgb_PL_progress.setValue(_audioCurrentTime);}
                if(_state == DLNA &&   _audioFileDuration){pgb_DL_progress.setNewMinMaxVal(0, _audioFileDuration); pgb_DL_progress.setValue(_audioCurrentTime);}
                if(_audioFileDuration) {
                    SerialPrintfcr("AUDIO_FILE:  " ANSI_ESC_GREEN "AudioCurrentTime " ANSI_ESC_GREEN "%li:%02lis, " ANSI_ESC_GREEN "AudioFileDuration " ANSI_ESC_GREEN "%li:%02lis",
                                   (long int)_audioCurrentTime / 60, (long int)_audioCurrentTime % 60, (long int)_audioFileDuration / 60, (long int)_audioFileDuration % 60);
                }
            }
        }
        //------------------------------------------NEW STREAMTITLE-----------------------------------------------------------------------------------
        if(_f_newStreamTitle && !_timeCounter.timer) {
            _f_newStreamTitle = false;
            if(_state == RADIO) {
                if(strlen(_streamTitle)) showStreamTitle(_streamTitle);
                else if(strlen(_icyDescription)) {
                    showStreamTitle(_icyDescription);
                    _f_newIcyDescription = false;
                    webSrv.send("icy_description=", _icyDescription);
                }
                else txt_RA_sTitle.writeText("");
            }
            webSrv.send("streamtitle=", _streamTitle);
        }
        //------------------------------------------NEW ICY-DESCRIPTION-------------------------------------------------------------------------------
        if(_f_newIcyDescription && !_timeCounter.timer) {
            if(_state == RADIO) {
                if(!strlen(_streamTitle)) showStreamTitle(_icyDescription);
            }
            webSrv.send("icy_description=", _icyDescription);
            _f_newIcyDescription = false;
        }
        //------------------------------------------NEW COMMERCIALS-----------------------------------------------------------------------------------
        if(_f_newCommercial && !_timeCounter.timer) {
            if(_state == RADIO) { showStreamTitle(_commercial); }
            webSrv.send("streamtitle=", _commercial);
            _f_newCommercial = false;
        }
        //------------------------------------------END OF COMMERCIALS--------------------------------------------------------------------------------
        if(_commercial_dur > 0) {
            _commercial_dur--;
            if((_commercial_dur == 2) && (_state == RADIO)) clearStreamTitle(); // end of commercial? clear streamtitle
        }
        //------------------------------------------DETERMINE AUDIOCODEC------------------------------------------------------------------------------
        if(_cur_Codec == 0) {
            uint8_t c = audioGetCodec();
            if(c != 0 && c != 8 && c < 10) { // unknown or OGG, guard: c {1 ... 7, 9}
                _cur_Codec = c;
                SerialPrintfln("Audiocodec:  " ANSI_ESC_YELLOW "%s", codecname[c]);
                if(_state == PLAYER) showFileLogo(PLAYER);
                if(_state == RADIO && _f_logoUnknown == true) {
                    _f_logoUnknown = false;
                    showFileLogo(_state);
                }
            }
        }
        //------------------------------------------CONNECT TO LASTHOST-------------------------------------------------------------------------------
        if(_f_connectToLasthost){
            _f_connectToLasthost = false;
            connecttohost(_lastconnectedhost.c_str());
        }
        //------------------------------------------RECONNECT AFTER FAIL------------------------------------------------------------------------------
        if(_f_reconnect && !_f_accessPoint){
            _f_reconnect = false;
            _reconnectCnt ++;
            if(_reconnectCnt < 3){
                SerialPrintfln("RECONNECTION " ANSI_ESC_RED "to %s, try %i", _lastconnectedhost.c_str(), _reconnectCnt);
                connectToWiFi();
                connecttohost(_lastconnectedhost.c_str());
                if(audioIsRunning()) _reconnectCnt = 0;
            }
        }
        //------------------------------------------SEEK DLNA SERVER----------------------------------------------------------------------------------
        if(_f_dlnaSeekServer) {
            _f_dlnaSeekServer = false;
            dlna.seekServer();
        }
        //------------------------------------------CREATE DLNA PLAYLIST------------------------------------------------------------------------------
        if(_f_dlnaMakePlaylistOTF && _f_dlna_browseReady){
            _f_dlnaMakePlaylistOTF = false;
            _f_dlna_browseReady = false;
            if(preparePlaylistFromDLNAFolder()) processPlaylist(true);
        }
        //------------------------------------------DLNA ITEMS RECEIVED-------------------------------------------------------------------------------
        if(_f_dlna_browseReady){ // unused
            _f_dlna_browseReady = false;
        }
        //-------------------------------------------WIFI DISCONNECTED?-------------------------------------------------------------------------------
        if(!_f_accessPoint){
            if((WiFi.status() != WL_CONNECTED)) {
                _WiFi_disconnectCnt ++;
                if(_WiFi_disconnectCnt == 15){
                    _WiFi_disconnectCnt = 1;
                    SerialPrintfln("WiFi      :  " ANSI_ESC_YELLOW "Reconnecting to WiFi...");
                    WiFi.disconnect();
                    WiFi.reconnect();
                }
            }
            else{
                if(_WiFi_disconnectCnt){
                    _WiFi_disconnectCnt = 0;
                    if(_state == RADIO) audioConnecttohost(_lastconnectedhost.c_str());
                }
            }
        }
        //------------------------------------------GET AUDIO FILE ITEMS------------------------------------------------------------------------------
        if(_f_isFSConnected) {
            //    uint32_t t = 0;
            //    uint32_t fs = audioGetFileSize();
            //    uint32_t br = audioGetBitRate();
            //    if(br) t = (fs * 8)/ br;
            //    log_w("Br %d, Dur %ds", br, t);
        }
        //--------------------------------------AMBIENT LIGHT SENSOR BH1750---------------------------------------------------------------------------
        if(_f_BH1750_found){
            int32_t ambVal = BH1750.getBrightness();
            if(ambVal <= 0) goto endbrightness;
            if(ambVal > 1500) ambVal = 1500;
            _bh1750Value = map_l(ambVal, 0, 1500, 5, 100);
        //    log_i("_bh1750Value %i, _brightness %i", _bh1750Value, _brightness);
            if(!_f_sleeping){
                if(_bh1750Value >= _brightness) setTFTbrightness(_bh1750Value);
                else setTFTbrightness(_brightness);
            }
endbrightness:
            BH1750.start();
        }
    } //  END _f_1sec


    if(_f_10sec == true) { // calls every 10 seconds
        _f_10sec = false;
        if(_state == RADIO && !_icyBitRate && !_f_sleeping) {
            _decoderBitRate = audioGetBitRate();
            static uint32_t oldBr = 0;
            if(_decoderBitRate != oldBr){
                oldBr = _decoderBitRate;
                dispFooter.updateBitRate(_decoderBitRate / 1000);
            }
        }
        updateSettings();
    }

    if(_f_1min == true) {  // calls every minute
        _f_1min = false;
        if(_sleeptime){
            _sleeptime--;
            if(!_sleeptime) fall_asleep();
            dispFooter.updateOffTime(_sleeptime);
        }
    }

