schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Events from IR Library
void ir_code(uint8_t addr, uint8_t cmd) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "IR address " ANSI_ESC_BLUE "0x%02x, " ANSI_ESC_YELLOW "IR command " ANSI_ESC_BLUE "0x%02x", addr, cmd);
    char buf[20];
    sprintf(buf, "0x%02x", addr);
    webSrv.send("IR_address=", buf);
    sprintf(buf, "0x%02x", cmd);
    webSrv.send("IR_command=", buf);
}

void ir_res(uint32_t res) {
    if(_state != RADIO) return;
    if(_f_sleeping == true) return;
    SerialPrintfln("ir_result:   " ANSI_ESC_YELLOW "Stationnumber " ANSI_ESC_BLUE "%lu", (long unsigned)res);
    _f_irResultSeen = true;
    _f_irNumberSeen = false;
    _irResult = res;
    return;
}
void ir_number(uint16_t num) {
    if(_state != RADIO) return;
    if(_f_sleeping) return;
    _f_irNumberSeen = true;
    _irNumber = num;
    _radioSubmenue = 3;
    changeState(RADIO);
}
void ir_short_key(uint8_t key) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "short pressed key nr: " ANSI_ESC_BLUE "%02i", key);
    // if(_f_sleeping == true && key != 16) return;
    if(_f_sleeping == true && key == 17) {
        wake_up();
        return;
    } // awake
    if(_state == IR_SETTINGS) return;  // nothing todo

    switch(key) {
        case 15:    if(_state == SLEEP) {changeState(RADIO); break;} // MODE -- CLOCK <-> RADIO
                    if(_state == RADIO) {changeState(STATIONSLIST); break;}
                    if(_state == STATIONSLIST) {changeState(PLAYER); break;}
                    if(_state == PLAYER) {changeState(DLNA); break;}
                    if(_state == DLNA) {changeState(CLOCK); break;}
                    if(_state == CLOCK) {changeState(RADIO); break;}
                    break;
        case 14:    if(_state == STATIONSLIST) {lst_RADIO.prevStation(); setTimeCounter(4); break;}
                    upvolume(); // ARROW UP -- VOLUME+
                    break;
        case 13:    if(_state == STATIONSLIST) {lst_RADIO.nextStation(); setTimeCounter(4); break;}
                    downvolume(); // ARROW DOWN -- VOLUME-
                    break;
        case 11:    if(_state == STATIONSLIST) {lst_RADIO.nextPage(); setTimeCounter(4); break;}
                    if(_state == RADIO) {nextFavStation(); break;} // ARROW RIGHT -- NEXT STATION
                    if(_state == CLOCK) {nextFavStation(); changeState(RADIO); _f_switchToClock = true; break;}
                    if(_state == SLEEP) {display_sleeptime(1); break;}
                    break;
        case 12:    if(_state == STATIONSLIST) {lst_RADIO.prevPage(); setTimeCounter(4); break;}
                    if(_state == RADIO) {prevFavStation(); break;} // ARROW LEFT -- PREV STATION
                    if(_state == CLOCK) {prevFavStation(); changeState(RADIO); _f_switchToClock = true; break;}
                    if(_state == SLEEP) {display_sleeptime(-1); break;}
                    break;
        case 10:    muteChanged(!_f_mute); // MUTE
                    break;
        case 16:    if(_f_sleeping == true){wake_up(); break;} // OK
                    if(_state == STATIONSLIST) {changeState(RADIO); setStationByNumber(lst_RADIO.getSelectedStation()); break;}
                    if(_state == RADIO) {changeState(SLEEP); break;} // OFF TIMER
                    if(_state == SLEEP) {changeState(RADIO); break;}
                    break;
        default:    break;
    }
}
void ir_long_key(int8_t key) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "long pressed key nr: " ANSI_ESC_BLUE "%02i", key);
    if(key == 20) fall_asleep(); // long mute
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Event from TouchPad
// clang-format off
void tp_pressed(uint16_t x, uint16_t y) {
    //  SerialPrintfln("tp_pressed, state is: %i", _state);
    //  SerialPrintfln(ANSI_ESC_YELLOW "Touchpoint  x=%d, y=%d", x, y);

    if(_f_sleeping) return;  // awake in tp_released()

    // all state
    if(dispFooter.positionXY(x, y)) return;

    switch(_state) {
        case RADIO:
            if(_radioSubmenue == 1){
                if(sdr_RA_volume.positionXY(x,y)) return;
                if(btn_RA_Mute.positionXY(x, y)) return;
                if(btn_RA_prevSta.positionXY(x, y)) return;
                if(btn_RA_nextSta.positionXY(x, y)) return;
                if(btn_RA_staList.positionXY(x, y)) return;
                if(VUmeter_RA.positionXY(x, y)) return;
            }
            if(_radioSubmenue == 2){
                if(btn_RA_player.positionXY(x, y)) return;
                if(btn_RA_dlna.positionXY(x, y)) return;
                if(btn_RA_clock.positionXY(x, y)) return;
                if(btn_RA_sleep.positionXY(x, y)) return;
                if(btn_RA_bright.positionXY(x, y)) return;
                if(btn_RA_equal.positionXY(x, y)) return;
                if(btn_RA_bt.positionXY(x, y)) return;
                if(btn_RA_off.positionXY(x, y)) return;
            }
            _radioSubmenue++;
            if(_radioSubmenue == 3) _radioSubmenue = 0;
            changeState(RADIO);
            return;
            break;
        case PLAYER:
            if(_playerSubmenue == 0){
                if(btn_PL_prevFile.positionXY(x, y)) return;
                if(btn_PL_nextFile.positionXY(x, y)) return;
                if(btn_PL_ready.positionXY(x, y)) return;;
                if(btn_PL_playAll.positionXY(x, y)) return;
                if(btn_PL_shuffle.positionXY(x, y)) return;
                if(btn_PL_fileList.positionXY(x, y)) return;
                if(btn_PL_radio.positionXY(x, y)) return;
                if(btn_PL_off.positionXY(x, y)) return;
            }
            if(_playerSubmenue == 1){
                if(sdr_PL_volume.positionXY(x,y)) return;
                if(btn_PL_Mute.positionXY(x, y)) return;
                if(btn_PL_pause.positionXY(x, y)) return;
                if(btn_PL_cancel.positionXY(x, y)) return;
                if(btn_PL_playNext.positionXY(x, y)) return;
                if(btn_PL_playPrev.positionXY(x, y)) return;
            }
            break;
        case AUDIOFILESLIST:
                if(lst_PLAYER.positionXY(x, y)) return;
                break;
        case DLNA:
                if(sdr_DL_volume.positionXY(x,y)) return;
                if(btn_DL_Mute.positionXY(x, y)) return;
                if(btn_DL_pause.positionXY(x, y)) return;
                if(btn_DL_radio.positionXY(x, y)) return;
                if(btn_DL_fileList.positionXY(x, y)) return;
                if(btn_DL_cancel.positionXY(x, y)) return;
                break;
        case DLNAITEMSLIST:
                if(lst_DLNA.positionXY(x, y)) return;
                break;
        case CLOCK:
            if(_clockSubMenue == 0){
                if(clk_CL_green.positionXY(x, y)) return;
            }
            if(_clockSubMenue == 1){
                if(btn_CL_Mute.positionXY(x, y)) return;
                if(btn_CL_alarm.positionXY(x, y)) return;
                if(btn_CL_radio.positionXY(x, y)) return;
                if(sdr_CL_volume.positionXY(x,y)) return;
                if(btn_CL_off.positionXY(x, y)) return;
            }
            break;
        case ALARM:
                if(clk_AL_red.positionXY(x, y)) return;
                if(btn_AL_left.positionXY(x, y)) return;
                if(btn_AL_right.positionXY(x, y)) return;
                if(btn_AL_up.positionXY(x, y)) return;
                if(btn_AL_down.positionXY(x, y)) return;
                if(btn_AL_ready.positionXY(x, y)) return;
                break;
        case SLEEP:
                if(btn_SL_up.positionXY(x, y)) return;
                if(btn_SL_down.positionXY(x, y)) return;
                if(btn_SL_ready.positionXY(x, y)) return;
                if(btn_SL_cancel.positionXY(x, y)) return;
                break;
        case BRIGHTNESS:
                if(sdr_BR_value.positionXY(x,y)) return;
                if(btn_BR_ready.positionXY(x, y)) return;
                if(pic_BR_logo.positionXY(x, y)) return;
                break;
        case EQUALIZER:
                if(sdr_EQ_lowPass.positionXY(x,y)) return;
                if(sdr_EQ_bandPass.positionXY(x,y)) return;
                if(sdr_EQ_highPass.positionXY(x,y)) return;
                if(sdr_EQ_balance.positionXY(x,y)) return;
                if(btn_EQ_lowPass.positionXY(x, y)) return;
                if(btn_EQ_bandPass.positionXY(x, y)) return;
                if(btn_EQ_highPass.positionXY(x, y)) return;
                if(btn_EQ_balance.positionXY(x, y)) return;
                if(txt_EQ_lowPass.positionXY(x, y)) return;
                if(txt_EQ_bandPass.positionXY(x, y)) return;
                if(txt_EQ_highPass.positionXY(x, y)) return;
                if(txt_EQ_balance.positionXY(x, y)) return;
                if(btn_EQ_Radio.positionXY(x, y)) return;
                if(btn_EQ_Player.positionXY(x,y)) return;
                if(btn_EQ_Mute.positionXY(x, y)) return;
                break;
        case BLUETOOTH:
                if(btn_BT_volUp.positionXY(x, y)) return;
                if(btn_BT_volDown.positionXY(x, y)) return;
                if(btn_BT_pause.positionXY(x, y)) return;
                if(btn_BT_mode.positionXY(x, y)) return;
                if(btn_BT_radio.positionXY(x, y)) return;
                if(btn_BT_power.positionXY(x, y)) return;
                break;
        case IR_SETTINGS:
                if(btn_IR_radio.positionXY(x, y))return;
        default:
                break;
    }
}
void tp_long_pressed(uint16_t x, uint16_t y){

