schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(_state == RADIO) {
        if( val && strcmp(name, "btn_RA_Mute") == 0)    {setTimeCounter(2); {if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && strcmp(name, "btn_RA_prevSta") == 0) {setTimeCounter(2); return;}
        if( val && strcmp(name, "btn_RA_nextSta") == 0) {setTimeCounter(2); return;}
        if( val && strcmp(name, "btn_RA_staList") == 0) {return;}
        if( val && strcmp(name, "btn_RA_player") == 0)  {return;}
        if( val && strcmp(name, "btn_RA_dlna") == 0)    {return;}
        if( val && strcmp(name, "btn_RA_clock") == 0)   {return;}
        if( val && strcmp(name, "btn_RA_sleep") == 0)   {return;}
        if( val && strcmp(name, "btn_RA_bright") == 0)  {return;}
        if(!val && strcmp(name, "btn_RA_bright") == 0)  {setTimeCounter(2); return;}
        if( val && strcmp(name, "btn_RA_equal") == 0)   {return;}
        if( val && strcmp(name, "btn_RA_bt") == 0)      {return;}
        if(!val && strcmp(name, "btn_RA_bt") == 0)      {setTimeCounter(2); return;}
        if( val && strcmp(name, "btn_RA_off") == 0)     {return;}
        if( val && strcmp(name, "VUmeter_RA") == 0)     {return;}
    }
    if(_state == STATIONSLIST) {
        if( val && strcmp(name, "lst_RADIO") == 0)      {setTimeCounter(4); return;}
    }
    if(_state == PLAYER) {
        if( val && strcmp(name, "btn_PL_Mute") == 0)    {{if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && strcmp(name, "btn_PL_pause") == 0)   {return;}
        if( val && strcmp(name, "btn_PL_cancel") == 0)  {return;}
        if( val && strcmp(name, "btn_PL_prevFile") == 0){if(_cur_AudioFileNr > 0) {_cur_AudioFileNr--; showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber();} return;}
        if( val && strcmp(name, "btn_PL_nextFile") == 0){if(_cur_AudioFileNr + 1 < _SD_content.getSize()) {_cur_AudioFileNr++; showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber();} return;}
        if( val && strcmp(name, "btn_PL_ready") == 0)   {return;}
        if( val && strcmp(name, "btn_PL_playAll") == 0) {return;}
        if( val && strcmp(name, "btn_PL_shuffle") == 0) {return;}
        if( val && strcmp(name, "btn_PL_fileList") == 0){return;}
        if( val && strcmp(name, "btn_PL_radio") == 0)   {return;}
        if( val && strcmp(name, "btn_PL_off") == 0)     {return;}
        if( val && strcmp(name, "btn_PL_playPrev") == 0){_cur_AudioFileNr = _SD_content.getPrevAudioFile(_cur_AudioFileNr); return;}
        if( val && strcmp(name, "btn_PL_playNext") == 0){_cur_AudioFileNr = _SD_content.getNextAudioFile(_cur_AudioFileNr); return;}
    }
    if(_state == AUDIOFILESLIST) {
        if( val && strcmp(name, "lst_PLAYER") == 0)     {setTimeCounter(4); return;}
    }
    if(_state == DLNA) {
        if( val && strcmp(name, "btn_DL_Mute") == 0)    {{if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && strcmp(name, "btn_DL_pause") == 0)   {return;}
        if( val && strcmp(name, "btn_DL_radio") == 0)   {return;}
        if( val && strcmp(name, "btn_DL_fileList") == 0){return;}
        if( val && strcmp(name, "btn_DL_cancel") == 0)  {clearStationName(); btn_DL_pause.setInactive(); return;}
    }
    if(_state == DLNAITEMSLIST) {
        if( val && strcmp(name, "lst_DLNA") == 0)       {setTimeCounter(15); _f_dlnaWaitForResponse = true; return;}
    }
    if(_state == CLOCK) {
        if( val && strcmp(name, "btn_CL_Mute") == 0)    {setTimeCounter(2); if(!_f_mute){ _f_muteIsPressed = true;} return;}
        if( val && strcmp(name, "btn_CL_alarm") == 0)   {return;}
        if( val && strcmp(name, "btn_CL_radio") == 0)   {return;}
        if( val && strcmp(name, "clk_CL_green") == 0)   {return;}
        if( val && strcmp(name, "btn_CL_off") == 0)     {return;}
    }
    if(_state == ALARM) {
        if( val && strcmp(name, "clk_AL_red") == 0)     {return;}
        if( val && strcmp(name, "btn_AL_left") == 0)    {return;}
        if( val && strcmp(name, "btn_AL_right") == 0)   {return;}
        if( val && strcmp(name, "btn_AL_up") == 0)      {return;}
        if( val && strcmp(name, "btn_AL_down") == 0)    {return;}
        if( val && strcmp(name, "btn_AL_ready") == 0)   {return;}
    }
    if(_state == SLEEP) {
        if( val && strcmp(name, "btn_SL_up") == 0)      {return;}
        if( val && strcmp(name, "btn_SL_down") == 0)    {return;}
        if( val && strcmp(name, "btn_SL_ready") == 0)   {return;}
        if( val && strcmp(name, "btn_SL_cancel") == 0)  {return;}
    }
    if(_state == BRIGHTNESS){
        if( val && strcmp(name, "btn_BR_ready") == 0)   {return;}
        if( val && strcmp(name, "pic_BR_logo") == 0)    {return;}
    }
    if(_state == EQUALIZER) {
        if( val && strcmp(name, "btn_E_LP") == 0)       {sdr_EQ_lowPass.setValue(0);  return;}
        if( val && strcmp(name, "btn_E_BP") == 0)       {sdr_EQ_bandPass.setValue(0); return;}
        if( val && strcmp(name, "btn_E_HP") == 0)       {sdr_EQ_highPass.setValue(0); return;}
        if( val && strcmp(name, "btn_E_BAL") == 0)      {sdr_EQ_balance.setValue(0);  return;}
        if( val && strcmp(name, "btn_EQ_Radio") == 0)   {return;}
        if( val && strcmp(name, "btn_EQ_Player") == 0)  {return;}
        if( val && strcmp(name, "btn_EQ_Mute") == 0)    {{if(!_f_mute) _f_muteIsPressed = true;} return;}
    }
    if(_state == BLUETOOTH) {
        if( val && strcmp(name, "btn_BT_pause") == 0)   {bt_emitter.pauseResume(); return;}
        if( val && strcmp(name, "btn_BT_radio") == 0)   {return;}
        if( val && strcmp(name, "btn_BT_volDown") == 0) {if(_BTvolume > 0)  {_BTvolume--; bt_emitter.downvolume();} return;}
        if( val && strcmp(name, "btn_BT_volUp") == 0)   {if(_BTvolume < 31) {_BTvolume++; bt_emitter.upvolume();}  return;}
        if( val && strcmp(name, "btn_BT_mode") == 0)    {bt_emitter.changeMode(); return;}
        if( val && strcmp(name, "btn_BT_power") == 0)   {return;}
    }
    if(_state == IR_SETTINGS) {
        if( val && strcmp(name, "btn_IR_radio") == 0)   {return;}
    }
    log_d("unused event: graphicObject %s was clicked", name);
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void graphicObjects_OnRelease(const char* name, releasedArg ra) {

    // all state
        if(strcmp(name, "dispFooter") == 0)      {return;}

