schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(_state == RADIO) {
        if(strcmp(name, "btn_RA_Mute") == 0)     {muteChanged(btn_RA_Mute.getValue()); return;}
        if(strcmp(name, "btn_RA_prevSta") == 0)  {prevFavStation(); dispFooter.updateStation(_cur_station); return;}
        if(strcmp(name, "btn_RA_nextSta") == 0)  {nextFavStation(); dispFooter.updateStation(_cur_station); return;}
        if(strcmp(name, "btn_RA_staList") == 0)  {_radioSubmenue = 0; changeState(STATIONSLIST); return;}
        if(strcmp(name, "btn_RA_player") == 0)   {_radioSubmenue = 0; stopSong(); changeState(PLAYER); return;}
        if(strcmp(name, "btn_RA_dlna") == 0)     {_radioSubmenue = 0; stopSong(); changeState(DLNA); return;}
        if(strcmp(name, "btn_RA_clock") == 0)    {_radioSubmenue = 0; changeState(CLOCK); return;}
        if(strcmp(name, "btn_RA_sleep") == 0)    {_radioSubmenue = 0; changeState(SLEEP); return;}
        if(strcmp(name, "btn_RA_bright") == 0)   {_radioSubmenue = 0; changeState(BRIGHTNESS); return;}
        if(strcmp(name, "btn_RA_equal") == 0)    {_radioSubmenue = 0; changeState(EQUALIZER); return;}
        if(strcmp(name, "btn_RA_equal") == 0)    {_radioSubmenue = 0; changeState(EQUALIZER); return;}
        if(strcmp(name, "btn_RA_bt") == 0)       {_radioSubmenue = 0; changeState(BLUETOOTH); return;}
        if(strcmp(name, "btn_RA_off") == 0)      {fall_asleep(); return;}
        if(strcmp(name, "VUmeter_RA") == 0)      {return;}
        if(strcmp(name, "sdr_RA_volume") == 0)   {return;}
    }
    if(_state == STATIONSLIST) {
        if(strcmp(name, "lst_RADIO") == 0)       {if(ra.val1){_radioSubmenue = 0; setStationByNumber(ra.val1); changeState(RADIO);} return;}
    }
    if(_state == PLAYER) {
        if(strcmp(name, "btn_PL_Mute") == 0)     {muteChanged(btn_PL_Mute.getValue()); return;}
        if(strcmp(name, "btn_PL_pause") == 0)    {if(_f_isFSConnected) {audioPauseResume();} return;}
        if(strcmp(name, "btn_PL_cancel") == 0)   {_playerSubmenue = 0; stopSong(); changeState(PLAYER); return;}
        if(strcmp(name, "btn_PL_prevFile") == 0) {return;}
        if(strcmp(name, "btn_PL_nextFile") == 0) {return;}
        if(strcmp(name, "btn_PL_ready") == 0)    {_playerSubmenue = 1; SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); changeState(PLAYER); showAudioFileNumber(); return;}
        if(strcmp(name, "btn_PL_playAll") == 0)  {_playerSubmenue = 1; _f_shuffle = false; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true); changeState(PLAYER); return;}
        if(strcmp(name, "btn_PL_shuffle") == 0)  {_playerSubmenue = 1; _f_shuffle = true; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true); changeState(PLAYER); return;}
        if(strcmp(name, "btn_PL_fileList") == 0) {_playerSubmenue = 1; _SD_content.listDir(_cur_AudioFolder, true, false); changeState(AUDIOFILESLIST); return;}
        if(strcmp(name, "btn_PL_radio") == 0)    {_playerSubmenue = 0; setStation(_cur_station); changeState(RADIO); return;}
        if(strcmp(name, "btn_PL_off") == 0)      {fall_asleep(); return;}
        if(strcmp(name, "sdr_PL_volume") == 0)   {return;}
        if(strcmp(name, "btn_PL_playNext") == 0) {SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); return;}
        if(strcmp(name, "btn_PL_playPrev") == 0) {SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); return;}
    }
    if(_state == AUDIOFILESLIST){
        if(strcmp(name, "lst_PLAYER") == 0)      {if(ra.val1 == 1){;} // wipe up/down
                                                  if(ra.val1 == 2){strcpy(_cur_AudioFolder, ra.arg1); _cur_AudioFileNr = ra.val2; lst_PLAYER.show(_cur_AudioFolder, _cur_AudioFileNr);   } // next prev folder
                                                  if(ra.val1 == 3){strcpy(_cur_AudioFolder, ra.arg1); _cur_AudioFileNr = ra.val2; SD_playFile(ra.arg3);} return;}
    }
    if(_state == DLNA) {
        if(strcmp(name, "btn_DL_Mute") == 0)     {muteChanged(btn_DL_Mute.getValue()); return;}
        if(strcmp(name, "btn_DL_pause") == 0)    {audioPauseResume(); return;}
        if(strcmp(name, "btn_DL_radio") == 0)    {setStation(_cur_station); txt_DL_fName.setText(""); changeState(RADIO); return;}
        if(strcmp(name, "btn_DL_fileList") == 0) {changeState(DLNAITEMSLIST); txt_DL_fName.setText(""); return;}
        if(strcmp(name, "btn_DL_cancel") == 0)   {stopSong(); txt_DL_fName.setText(""); return;}
        if(strcmp(name, "sdr_DL_volume") == 0)   {return;}
    }
    if(_state == DLNAITEMSLIST) {
        if(strcmp(name, "lst_DLNA") == 0)        {if(ra.val1 == 1){txt_DL_fName.setTextColor(TFT_CYAN); txt_DL_fName.setText(ra.arg2, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER); changeState(DLNA); connecttohost(ra.arg1);} // play a file
                                                  if(ra.val1 == 2){dlna.browseServer(ra.val2, ra.arg1, 0, 50); _f_dlnaMakePlaylistOTF = true; } // browse dlna object, waiting for content and create a playlist
                                                  return;}
    }
    if(_state == CLOCK) {
        if(strcmp(name, "btn_CL_Mute") == 0)     {muteChanged(btn_CL_Mute.getValue()); return;}
        if(strcmp(name, "btn_CL_alarm") == 0)    {changeState(ALARM); return;}
        if(strcmp(name, "btn_CL_radio") == 0)    {_clockSubMenue = 0; changeState(RADIO); return;}
        if(strcmp(name, "clk_CL_green") == 0)    {_clockSubMenue = 1; changeState(CLOCK); return;}
        if(strcmp(name, "btn_CL_off") == 0)      {fall_asleep(); return;}
        if(strcmp(name, "sdr_CL_volume") == 0)   {return;}
    }
    if(_state == ALARM) {
        if(strcmp(name, "clk_AL_red") == 0)      {return;}
        if(strcmp(name, "btn_AL_left") == 0)     {clk_AL_red.shiftLeft(); return;}
        if(strcmp(name, "btn_AL_right") == 0)    {clk_AL_red.shiftRight(); return;}
        if(strcmp(name, "btn_AL_up") == 0)       {clk_AL_red.digitUp(); return;}
        if(strcmp(name, "btn_AL_down") == 0)     {clk_AL_red.digitDown(); return;}
        if(strcmp(name, "btn_AL_ready") == 0)    {updateSettings(); _clockSubMenue = 0; changeState(CLOCK); logAlarmItems(); return;}
    }
    if(_state == SLEEP) {
        if(strcmp(name, "btn_SL_up") == 0)       {display_sleeptime(1); return;}
        if(strcmp(name, "btn_SL_down") == 0)     {display_sleeptime(-1); return;}
        if(strcmp(name, "btn_SL_ready") == 0)    {dispFooter.updateOffTime(_sleeptime);  changeState(RADIO); return;}
        if(strcmp(name, "btn_SL_cancel") == 0)   {changeState(RADIO); return;}
    }
    if(_state == BRIGHTNESS){
        if(strcmp(name, "btn_BR_ready") == 0)    {changeState(RADIO); return;}
        if(strcmp(name, "pic_BR_logo") == 0)     {return;}
    }
    if(_state == EQUALIZER) {
        if(strcmp(name, "btn_EQ_Radio") == 0)    {setStation(_cur_station); changeState(RADIO); return;}
        if(strcmp(name, "btn_EQ_Player") == 0)   {changeState(PLAYER); return;}
        if(strcmp(name, "btn_EQ_Mute") == 0)     {muteChanged(btn_EQ_Mute.getValue()); return;}
    }
    if(_state == BLUETOOTH) {
        if(strcmp(name, "btn_BT_pause") == 0)    {return;}
        if(strcmp(name, "btn_BT_radio") == 0)    {changeState(RADIO); return;}
        if(strcmp(name, "btn_BT_volDown") == 0)  {return;}
        if(strcmp(name, "btn_BT_volUp") == 0)    {return;}
        if(strcmp(name, "btn_BT_mode") == 0)     {return;}
        if(strcmp(name, "btn_BT_power") == 0)    {_f_BTpower = !_f_BTcurPowerState; BTpowerChanged(!_f_BTcurPowerState); return;}
    }
    if(_state == IR_SETTINGS) {
        if(strcmp(name, "btn_IR_radio") == 0)    {changeState(RADIO); return;}
    }
    log_d("unused event: graphicObject %s was released", name);
}
// clang-format on